Revit 2024 API
RenderingSettings Members
The RenderingSettings type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the RenderingSettings
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBackgroundSettings
 Returns an object that represents the rendering background settings.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetRenderingImageExposureSettings
 Returns an object that represents the rendering image exposure settings.
GetRenderingQualitySettings
 Returns an object that represents the rendering quality settings.
GetRenderingRegionOutline
 Returns the outline of the rendering region.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetBackgroundSettings
 Changes the rendering background settings details for the current background style.
SetRenderingImageExposureSettings
 Changes the rendering image exposure settings.
SetRenderingQualitySettings
 Change rendering quality settings.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
BackgroundStyle
 The enum value that controls the background style for rendering.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LightingSource
 The lighting scheme type.
PrinterResolution
 The resolution level when using printer.
ResolutionTarget
 The resolution target.
ResolutionValue
 The rendering resolution in dots per inch (DPI).
UsesRegionRendering
 The bool value that indicates whether to use region rendering.
See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace